(function() { 'use strict'; retryWhileError(function() {
    let t1 = sl(0.1, 10, 0.1);
    let t2 = slKrome(t1, 0.1, 10, 0.1);
    let a = sl(1, 10);
    let b = (t1+t2)*a;
    let e = sl(1, 10).pm();
    let c = a*t1*t2 + e;
    let d = 2*a*t1*t2 + e;

    let ans = Math.abs(t1-t2);

	NAtask.setTask({
		text: `Высота над землeй подброшенного вверх мяча меняется по закону $h(t) = ${-a}t^2 + ${b}t + ${c}$, где $h$ - высота в метрах, 
        $t$ - время в секундах, прошедшее с момента броска. Сколько секунд мяч будет находиться на высоте ${['более', 'не менее'].iz()} ${d} метров?` ,
		answers: ans,
		authors: ['mcFrene'],
	});
	NAtask.modifiers.allDecimalsToStandard(/*true*/);
}, 2000);})();
//mcFrene
/*РешуЕГЭ: 27957: 28059, 41337, 41341, 507882, 507905, 516295, 516328, 628361, 628479, 28061,
28063, 28065, 28067, 28069, 41315, 41317, 41319, 41321, 41323, 41325, 41327, 41329, 41331, 41333,
41335, 41339, 507981
*/
