(function() { 'use strict'; retryWhileError(function() {
    let rangeU = sl(2, 5);
    let rangeD =  [-rangeU, 1].iz();
    let TrWeight = sl(2, 7);
    let InWeight = slKrome(TrWeight, 2, 7);
    let R = sl(1, 100);
    let Q = sl1();
    let ans = (InWeight + 1 + TrWeight + Q) * rangeU / R;
    genAssertZ1000(ans);
    
    let chisl = ['вдвое', 'втрое', 'вчетверо', 'впятеро', 'вшестеро', 'всемеро'];    
    let decorPreForm = [', то есть', '. В результате, формула примет вид'].iz();

	NAtask.setTask({
		text: `Независимое агентство намерено ввести рейтинг $R$ новостных интернет-изданий на основе показателей информативности $I_n$, оперативности $O_p$,
        объективности $T_r$ публикаций${(', а также качества $Q$ сайта').esli(Q)}. Каждый отдельный показатель - целое число от ${rangeD} до ${rangeU}. Составители рейтинга считают, что
        объективность ценится ${chisl[TrWeight - 2]}, а информативность публикаций ${chisl[InWeight - 2]} дороже, чем оперативность${(' и качество сайта').esli(Q)}${decorPreForm} 
        $R = \\frac{${InWeight}I_n + O_p + ${TrWeight}T_r ${('+Q').esli(Q)}}{A}$. Найдите, каким должно быть число A, чтобы издание, у которого все показатели максимальны, 
        получило рейтинг ${R}.`,
		answers: ans,
		authors: ['mcFrene'],
	});
	NAtask.modifiers.allDecimalsToStandard(/*true*/);
}, 2000);})();
//mcFrene
/*РешуЕГЭ: 317096: 317099, 317101, 317103, 317105, 317107, 317109, 317111, 317113, 317115, 
317117, 317119, 317121, 317123, 317125, 317127, 317129, 317131, 317133, 317135, 317137, 
317139, 317141, 317143, 317145, 317147, 317149, 317151, 317153, 317155, 317157, 317159, 
317161, 317163, 317165, 317167, 317169, 317171, 317173, 317175, 317177, 317179, 317181, 
317183, 317185, 317187, 317189, 319859, 559404, 559598, 319861, 319863, 319865, 319867, 
319869, 319871, 319873, 319875, 319877, 319879, 319881, 319883, 319885, 319887, 319889, 
319891, 319893, 319895, 319897, 319899, 319901, 319903, 319905, 319907, 319909, 319911, 
319913, 319915, 319917, 319919, 319921, 319923, 319925, 319927, 319929, 319931, 319933, 
319935, 319937, 319939, 319941, 319943, 319945, 319947, 319949, 319951, 319953, 319955, 
319957, 319959, 319860, 319961, 319963, 319965, 319967, 319969, 319971, 319973, 319975, 
319977, 319979, 319981, 319983, 319985, 319987, 319989, 319991, 319993, 319995
*/
