(function() { 'use strict'; retryWhileError(function() {
    let a = sl(0.0001, 0.001, 0.0001);
    let b = -sl(0.1, 0.9, 0.01);
    let c = sl(1, 100);
    let x = sl(5, 100, 5);
    genAssert(x < -b / a, 'Запрашиваемая ванта вообще находится в пределах пролёта');
    let f = (x => a * x * x + b * x + c);
    genAssert(f(-b / (2 * a)) > 1, 'Ванты не опускаются до полотна и не провисают');
    let y = f(x);
    genAssertZ1000(y, 'Ответ имеет не более 3 знаков после запятой');

    let svgString = '<svg viewBox="0 0 319.667 213"><g fill="#040606" font-family="Times New Roman" font-size="11.5" font-weight="400"><text transform="matrix(1.2 0 0 1.33333 152.356 160.643)" style="-inkscape-font-specification:TimesNewRomanPSMT"><tspan x="0 6.1525002 11.9025 17.641001 23.391001 28.418833 34.573341" y="0">полотно</tspan><tspan x="-51.408001 -45.97831 -40.874142 -34.719627 -29.694128" y="-75.732">ванта</tspan><tspan x="4.8284998 10.258182 15.36235 21.516859 26.5429" y="-51.482">ванта</tspan><tspan x="12.5785 18.731001 23.837 29.9895" y="-74.345">цепь</tspan></text><text transform="matrix(0 -1.2 1.33333 0 52.71 139.328)" style="-inkscape-font-specification:TimesNewRomanPSMT"><tspan x="0 6.1545143 12.309022 18.047522 23.797522" y="0">пилон</tspan><tspan x="0 6.1545143 12.309022 18.047522 23.797522" y="153.008">пилон</tspan></text></g><path fill="none" stroke="#040606" stroke-width=".66665" d="M150.333 158.333L121.267 148M89.333 57.09l-16.5 21.243M192.528 88.698l24.805 7.135M196.755 58.639l28.54 8.246M164.667 58.639L96.864 98.833"/><g fill="#040606" font-family="Times New Roman" font-size="11.5"><text transform="matrix(1.2 0 0 1.33333 45.808 163.737)" style="-inkscape-font-specification:TimesNewRomanPSMT" font-weight="400"><tspan x="0" y="0">0</tspan></text><text transform="matrix(1.2 0 0 1.33333 21.177 16.747)" style="-inkscape-font-specification:TimesNewRomanPS-ItalicMT" font-style="italic"><tspan x="0" y="0">y</tspan></text><text transform="matrix(1.2 0 0 1.33333 29.73 16.747)" style="-inkscape-font-specification:TimesNewRomanPSMT" font-weight="400"><tspan x="0 4.841578 12.314235" y="0">(м)</tspan></text><text transform="matrix(1.2 0 0 1.33333 291.52 166.895)" style="-inkscape-font-specification:TimesNewRomanPS-ItalicMT" font-style="italic"><tspan x="0" y="0">x</tspan></text><text transform="matrix(1.2 0 0 1.33333 300.295 166.895)" style="-inkscape-font-specification:TimesNewRomanPSMT" font-weight="400"><tspan x="0 4.8411379 12.314241" y="0">(м)</tspan></text></g><path fill="none" stroke="#040606" stroke-width="2.6666" d="M245.333 26v160.915"/><path fill="#040606" d="M247.695 26a2.36 2.36 0 11-4.723 0 2.36 2.36 0 012.361-2.361A2.36 2.36 0 01247.695 26M59.695 26a2.362 2.362 0 11-4.724.001A2.362 2.362 0 0159.695 26M75.195 61a2.36 2.36 0 01-2.362 2.361 2.36 2.36 0 110-4.722A2.36 2.36 0 0175.195 61M90.195 86.336a2.362 2.362 0 11-4.723 0 2.362 2.362 0 014.723 0M105.029 105.797a2.363 2.363 0 11-4.725 0 2.363 2.363 0 014.725 0M119.695 119.818a2.362 2.362 0 11-4.723 0 2.362 2.362 0 014.723 0M134.361 128.867a2.362 2.362 0 11-4.723 0 2.362 2.362 0 014.723 0M163.695 132.103a2.362 2.362 0 11-4.725.003 2.362 2.362 0 014.725-.003M178.361 125.456a2.362 2.362 0 11-4.724.003 2.362 2.362 0 014.724-.003M192.528 114.409a2.36 2.36 0 11-4.723 0 2.36 2.36 0 114.723 0M206.695 98.594a2.362 2.362 0 11-4.725.003 2.362 2.362 0 014.725-.003M219.695 80.112a2.363 2.363 0 01-2.362 2.365 2.363 2.363 0 010-4.728 2.36 2.36 0 012.362 2.363M233.028 57.09a2.362 2.362 0 11-4.724.005 2.362 2.362 0 014.724-.004M149.028 133.03a2.362 2.362 0 11-2.361-2.362 2.36 2.36 0 012.361 2.362"/><path fill="none" stroke="#040606" stroke-width="2.6666" d="M307.855 148H0"/><path fill="#040606" d="M305.212 144.29l14.455 3.87-14.455 3.876z"/><path fill="none" stroke="#040606" stroke-width="1.3333" d="M57.333 26l-48 122M245.333 26l48.334 122"/><path fill="none" stroke="#040606" stroke-width="2.6666" d="M57.333 26s38.167 106.667 94 107.333c51 .667 94-107.333 94-107.333M57.333 11.812v166.453"/><path fill="#040606" d="M53.622 14.455L57.493 0l3.877 14.455z"/><path fill="none" stroke="#040606" stroke-width="1.3333" d="M72.833 60.713V148M87.833 86.336v61.63M102.667 105.798V148M117.333 119.818V148M132 128.867v19.1M146.667 133.03V148M161.333 132.103v15.864M176 125.456V148M190.167 114.409v33.558M204.333 98.594v49.373M217.333 80.112v67.855M230.667 57.09v90.877"/><path fill="none" stroke="#040606" stroke-width="2.6666" d="M9.333 148c50.667 0 28.334 63.667 160.334 63.667 96 0 82.333-63.667 124-63.667"/><path fill="none" stroke="#040606" stroke-width="1.3333" d="M48.971 169.867c9.612-6 9.612-6 19.223 0 9.611 6 9.611 6 19.223 0 9.611-6 9.611-6 19.222 0s9.611 6 19.222 0 9.611-6 19.223 0c9.61 6 9.61 6 19.223 0 9.61-6 9.61-6 19.221 0 9.612 6 9.612 6 19.223 0 9.612-6 9.612-6 19.222 0 9.612 6 9.612 6 19.223 0 9.612-6 9.612-6 19.223 0"/><path fill="none" stroke="#040606" stroke-width="1.3333" d="M53.92 174.888c5.084-2.757 6.674-1.766 14.274 2.979 9.611 6 9.611 6 19.223 0 9.611-6 9.611-6 19.222 0s9.611 6 19.222 0 9.611-6 19.223 0c9.61 6 9.61 6 19.223 0 9.61-6 9.61-6 19.221 0 9.612 6 9.612 6 19.223 0 9.612-6 9.612-6 19.222 0 9.612 6 9.612 6 19.223 0 7.83-4.887 9.281-5.792 14.743-2.72"/><path fill="none" stroke="#040606" stroke-width="1.3333" d="M61.41 181.998c1.715.704 3.78 1.993 6.784 3.869 9.611 6 9.611 6 19.223 0 9.611-6 9.611-6 19.222 0s9.611 6 19.222 0 9.611-6 19.223 0c9.61 6 9.61 6 19.223 0 9.61-6 9.61-6 19.221 0 9.612 6 9.612 6 19.223 0 9.612-6 9.612-6 19.222 0 9.612 6 9.612 6 19.223 0 4.728-2.95 7.13-4.45 9.495-4.499"/></svg>';
	let svgBlob = new Blob([svgString], {type: 'image/svg+xml;charset=utf-8'});
    let url = URL.createObjectURL(svgBlob);
    let image = new Image();
    image.src = url;
    let paint1 = function(ct) {
        image.onload = function() {
            ct.drawImage(image, 0, 0);
            URL.revokeObjectURL(url);
        };
    };
    
    NAtask.setTask({
        text: 'На рисунке изображена схема моста. ' +
            'Вертикальные пилоны связаны провисающей цепью. ' +
            'Тросы, которые свисают с цепи и поддерживают полотно моста, называются вантами. ' +
            'Введём  систему  координат:  ' + [
                'ось $Oy$ направим вертикально вверх вдоль одного из пилонов',
                'ось $Ox$ направим вдоль полотна моста'
            ].shuffleJoin(', а ') +
            ', как показано на рисунке. ' +
            'В этой системе координат линия, по которой провисает цепь моста, ' +
            'задаётся формулой ' +
            ('$$y=' + a + 'x^2 +' + b + 'x+' + c + ',$$').plusminus() +
            ' где $x$ и $y$ измеряются в етрах. ' +
            'Найдите длину ванты, расположенной в ' + chislitlx(x, 'метр', 'p$') + ' от пилона. ' +
            'Ответ дайте в метрах.',
        answers: y,
        authors: ['Aisse-258', 'NickKolok', 'mcFrene']
    });
    NAtask.modifiers.allDecimalsToStandard(true);
    chas2.task.modifiers.addCanvasIllustration({
        width: 400,
        height: 400,
        paint: paint1
    });
}, 2000);
})();
//mcFrene
/*РешуЕГЭ: 324467: 325722 325723 325724 325725 325726 325727 325728 325729 325730
*/
