(function() {

var m=[
	['1922','Образование СССР'],
	['1936','Преобразование Казахской АССР РСФСР в Казахскую ССР'],
	['1936','Преобразование Киргизской АССР РСФСР в Киргизскую ССР'],
	['1936','Расформирование Закавказской СФСР'],
	['1936','Образование Азербайджанской ССР'],
	['1936','Образование Армянской ССР'],
	['1936','Образование Грузинской ССР'],
	['1929','Преобразование Таджикской АССР в Таджикскую ССР'],
	['1924','Начало образования Узбекской ССР (постановление ЦИК СССР)'],
	['1924','Начало образования Туркменской ССР (постановление ЦИК СССР)'],
	['1925','Завершение образования Узбекской ССР (Учредительный съезд советов республики)'],
	['1925','Завершение образования Туркменской ССР (Учредительный съезд советов республики)'],
	['1940','Образование Молдавской ССР и вхождение её в состав СССР'],
	['1940','Образование Литовской ССР и вхождение её в состав СССР'],
	['1940','Образование Латвийской ССР и вхождение её в состав СССР'],
	['1940','Образование Эстонской ССР и вхождение её в состав СССР'],
	['1940','Преобразование Карельской АССР в Карело-Финскую ССР'],
	['1956','Преобразование Карело-Финской ССР в Карельскую АССР'],
/*
	['19',''],
*/
].iz();

window.vopr.txt='Назовите год, в котором произошло событие:<br/><br/>'+
	m[1];
window.vopr.ver=[m[0]];
window.vopr.vrn=window.vopr.vrn_ist;
})();
