(function() { retryWhileError(function() {
    let a=sluchch(1,50).pm();
    let b=sluchch(1,50).pm();
    let c=sluchch(1,30).pm();
    let e=sluchch(1,50).pm();
    let d=(e*a-b*c)/c;
    genAssertZ1000(d, 'Корень не должен быть слишком дробным');
    genAssert(d!=-b, 'По условию');
    NAtask.setEquationTask({
    	parts: ['\\frac{'+a+'}{'+'x+'+b+'}', c.texfrac(e)],
	    roots: d,
	    authors: ['Китаева Вероника'],
    });	

}, 20);})();

// Решу ЕГЭ 311381: 338483 341402 311393 338482 338541 338591 338605 338683 338688 341111 341516 353594 448933 338496 338580 338597 338619 338647 338668 338672 338696 338742 338747 338780 338799 338813 338826 338830 338833 338843 338845 348621 348857 349499 349957 350518 350656 357112 357113 357114 402680 403074 403633
