(function() {
	retryWhileError(function() {
		let a = sluchch(1, 50).pm();
		let b = sluchch(1, 50).pm();
		let c = sluchch(1, 50).pm();
		let d = c / a - b;
		genAssertZ1000(d, 'Корень не должен быть слишком дробным');

		NAtask.setEquationTask({
			parts: [a + '(x+' + b + ')', c],
			roots: d,
			authors: ['Китаева Вероника'],
		});
	}, 20);
})();
// Решу ЕГЭ 338509: 338488 338606 338658 338983 340582 341490 338549 338634 338680 338700 338720 338770 338777 338789 338801 338811 338817 338820 338878 338900 338905 338934 338936 338941 338978 338987 357061 357062 357063 357064 357065 357066 357067 357068 357069 357070 357082 357083 357084 357085 357086 357087 402219 402408 402467 402512
// VeronikaKit
