(function() {
	'use strict';
	NAinfo.requireApiVersion(0, 0);   
	var slovo = [
		['МАТЕМАТИКА', 10, 24],
		['ФОРМУЛА', 7, 1],
		['АЛГЕБРА', 7, 2],
		['ЭКСПОНЕНТА', 10, 2],
		['УРАВНЕНИЕ', 9, 4],
		['ГЕОМЕТРИЯ', 9, 2],
		].iz();
	var p = slovo[1].fct() / slovo[2];
	var paper = sklonlxkand(['картон', 'бумага', 'ватман', 'пергамент'].iz());
	var otwet = '1)' + '$\\frac{1}{' + p + '}$' + '  2)' + '$\\frac{' + slovo[1] + '!}{' + slovo[2] + '}$';
		NAtask.setTask({
		text: 'Слово "' + slovo[0] + '" написали на полоске ' + paper.re + ' и разрезали полоску на буквы. ' +
				            'Найдите вероятность того, что составив все эти буквы случайным образом в ряд, мы снова получим слово "' + slovo[
				                    0] + '".' +
				            ' Сколько буквосочетаний можно составить из букв слова "' + slovo[0] + '"?',
		answers: otwet,
		});
})();

