(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ГУМАННЫЙ нужно употребить ГУМАНИТАРНЫЙ?'+
	'<br/>';
window.vopr.ver=[
	'Во время переговоров участниками встречи обсуждены ГУМАННЫЕ вопросы.',
];
window.vopr.nev=[
	'Самыми ГУМАННЫМИ профессиями на земле являются те, от которых зависит духовная жизнь и физическое здоровье человека.',
	'ГУМАННЫЕ законы возможны только в зрелом обществе.',
	'ГУМАННОЕ отношение к детям означает прежде всего понимание духовных усилий ребёнка, уважительное отношение к этим исканиям и ненавязчивую помощь.',
];
window.vopr.rsh='ГУМАННЫЙ — направленный на благо других; человеколюбивый и отзывчивый. ГУМАНИТАРНЫЙ — относящийся к изучению общества, культуры и истории народа в отличие от естественных и технических наук.';

AtoB();

})();
