(function() {
	'use strict';
	chas2.task.setTask({
			text: 'В каком предложении вместо слова ГУМАННЫЙ нужно употребить ГУМАНИТАРНЫЙ?' +
				'<br/>',
			answers: [
				'Во время переговоров участниками встречи обсуждены ГУМАННЫЕ вопросы.',
			],
			wrongAnswers: [
				'Самыми ГУМАННЫМИ профессиями на земле являются те, от которых зависит духовная жизнь и физическое здоровье человека.',
				'ГУМАННЫЕ законы возможны только в зрелом обществе.',
				'ГУМАННОЕ отношение к детям означает прежде всего понимание духовных усилий ребёнка, уважительное отношение к этим исканиям и ненавязчивую помощь.',
			],
			analys: 'ГУМАННЫЙ — направленный на благо других; человеколюбивый и отзывчивый. ГУМАНИТАРНЫЙ — относящийся к изучению общества, культуры и истории народа в отличие от естественных и технических наук.',
		}),
		AtoB();

})();
