(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова КАМЕННЫЙ нужно употребить слово КАМЕНИСТЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Переселенцам в этих краях приходилось очень туго: КАМЕННАЯ почва с трудом поддавалась обработке.',
];
window.vopr.nev=[
	'Первые КАМЕННЫЕ орудия были изготовлены человеком много веков назад.',
	'КАМЕННОЕ лицо Василия не выражало никаких эмоций.',
	'Старинный КАМЕННЫЙ особняк был фамильной гордостью этой семьи.',
];
window.vopr.rsh='КАМЕННЫЙ — состоящий из камня. По контексту подразумевается КАМЕНИСТАЯ почва.';

AtoB();
 
})();
