(function(){'use strict';

window.vopr.text='В каком предложении вместо слова ДОВЕРЧИВЫЙ нужно употребить слово ДОВЕРИТЕЛЬНЫЙ?'+
	'<br/>';
window.vopr.correctAnswers=[
	'Отношения между начальником и его подчинённым постепенно приобрели более ДОВЕРЧИВЫЙ характер.',
];
window.vopr.incorrectAnswers=[
	'Среди ДОВЕРЧИВЫХ людей нередко встречаются те, кто поплатился за свою доверчивость.',
	'Это было существо ДОВЕРЧИВОЕ, робкое и слабое.',
	'Братья его были настолько наивными и ДОВЕРЧИВЫМИ, что обмануть их было совсем нетрудно.',
];
window.vopr.solution='ДОВЕРЧИВЫЙ — легко доверяющий. По контексту подразумевается ДОВЕРИТЕЛЬНЫЙ.';

AtoB();

})();
