(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ВЕЧНЫЙ нужно употребить ВЕКОВОЙ?'
	+'<br/>';
window.vopr.ver=[
	'Густые заросли кустарника чередовались с ВЕЧНЫМИ дубовыми рощами и берёзовыми лесочками.',
];
window.vopr.nev=[
	'Долгими осенними вечерами хозяин не выходил из комнаты и в неизменном халате, с ВЕЧНОЮ трубкою в зубах, сидел у окна.',
	'Среди ВЕЧНЫХ человеческих ценностей наиболее важной для него была честность.',
	'В районах ВЕЧНОЙ мерзлоты дома строятся по специальным проектам.',
];
window.vopr.rsh='ВЕЧНЫЕ рощи — рощи, живущие всегда. По контексту подразумеваются ВЕКОВЫЕ рощи.';

AtoB();
 
})();
