(function(){'use strict';

window.vopr.text='В каком предложении вместо слова ДОЖДЕВОЙ нужно употребить слово ДОЖДЛИВЫЙ?'+
	'<br/>';
window.vopr.correctAnswers=[
	'День обещал быть ветреным и ДОЖДЕВЫМ.',
];
window.vopr.incorrectAnswers=[
	'На темном листе блестела одна-единственная ДОЖДЕВАЯ капля.',
	'Сдвигая вековые камни, обрушились вниз ДОЖДЕВЫЕ потоки.',
	'Из сада хлынул чистый ДОЖДЕВОЙ запах, дурманящий аромат цветущей липы.',
];
window.vopr.solution='ДОЖДЕВОЙ день — день, связанный с дождем. По контексту подразумевается ДОЖДЛИВЫЙ день.';

AtoB();

})();
