(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ДОЖДЕВОЙ нужно употребить слово ДОЖДЛИВЫЙ?'+
	'<br/>';
window.vopr.ver=[
	'День обещал быть ветреным и ДОЖДЕВЫМ.',
];
window.vopr.nev=[
	'На темном листе блестела одна-единственная ДОЖДЕВАЯ капля.',
	'Сдвигая вековые камни, обрушились вниз ДОЖДЕВЫЕ потоки.',
	'Из сада хлынул чистый ДОЖДЕВОЙ запах, дурманящий аромат цветущей липы.',
];
window.vopr.rsh='ДОЖДЕВОЙ день — день, связанный с дождем. По контексту подразумевается ДОЖДЛИВЫЙ день.';

AtoB();

})();
