(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ЗЛОЙ нужно употребить ЗЛОСТНЫЙ?'+
	'<br/>';
window.vopr.ver=[
	'Имейте в виду, что ЗЛЫЕ браконьеры являются уголовными преступниками и будут непременно наказаны.',
];
window.vopr.nev=[
	'Здесь было так неуютно и страшно, как в заколдованном царстве, где всё уснуло по прихоти ЗЛОЙ феи.',
	'Не по ЗЛОЙ воле он допускал промахи и ошибки.',
	'Человек он был ЗЛОЙ: ему непременно нужно было кого-то мучить.',
];
window.vopr.rsh='ЗЛЫЕ браконьеры — браконьеры, испытывающие злобу. По контексту подразумеваются ЗЛОСТНЫЕ браконьеры. ';

AtoB();

})();
