(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ДИПЛОМАТИЧНЫЙ нужно употребить слово ДИПЛОМАТИЧЕСКИЙ?'
	+'<br/>';
window.vopr.ver=[
	'Он постоянно нарушал ДИПЛОМАТИЧНЫЙ этикет, разговаривая с послами без учета требований речевого поведения.',
];
window.vopr.nev=[
	'Константин — человек мягкий, тонкий, весьма ДИПЛОМАТИЧНЫЙ.',
	'Ответ был составлен в ДИПЛОМАТИЧНЫХ выражениях.',
	'Выступление главного редактора оказалось неожиданно уклончивым и ДИПЛОМАТИЧНЫМ.',
];
window.vopr.rsh='ДИПЛОМАТИЧЕСКИЙ этикет — свойственный дипломату этикет. По контексту подразумевается ДИПЛОМАТИЧЕСКИЙ этикет.';

AtoB();
 
})();
