(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ЕДИНСТВЕННЫЙ  нужно употребить слово ЕДИНИЧНЫЙ?'+
	'<br/>';
window.vopr.ver=[
	'Вам стоит обратить внимание на работу цеха в целом, а не на ЕДИНСТВЕННЫЕ случаи производственных сбоев. ',
];
window.vopr.nev=[
	'Долгое время в медицине ЕДИНСТВЕННЫМ материалом для опытов по изучению сильнодействующих ядов были мелкие животные. ',
	'По мнению многих психологов, ЕДИНСТВЕННЫЙ ребенок в семье чаще всего чувствует себя одиноким и плохо адаптируется в обществе. ',
	'Ромен Роллан, близко знавший Фритьофа Нансена, назвал его ЕДИНСТВЕННЫМ европейским героем своего времени. ',
];

AtoB();

})();
