(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова КОМАНДИРОВАННЫЙ нужно употребить слово КОМАНДИРОВОЧНЫЙ?'+
	'<br/>';
window.vopr.ver=[
	'КОМАНДИРОВАННОЕ удостоверение инженер положил на стол.',
];
window.vopr.nev=[
	'Нас поселили в доме для КОМАНДИРОВАННЫХ.',
	'Со мною в гостинице жил КОМАНДИРОВАННЫЙ — приятный человек с рыжей бородой.',
	'Простите, как вы попали на этот завод? Вы КОМАНДИРОВАННЫЙ?',
];
window.vopr.rsh='КОМАНДИРОВАННЫЙ — человек, направленный в командировку. По контексту подразумевается КОМАНДИРОВОЧНЫЙ.';

AtoB();

})();
