(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ВЗРЫВНОЙ нужно употребить слово ВЗРЫВЧАТЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Нужно следить за тем, чтобы дети не играли со ВЗРЫВНЫМИ предметами.',
];
window.vopr.nev=[
	'ВЗРЫВНОЙ волной были выбиты все стёкла соседнего дома.',
	'Военные без особых усилий сумели обезвредить ВЗРЫВНОЕ устройство.',
	'ВЗРЫВНОЙ характер Ильи мешал гостям сосредоточиться и понять, что он хочет им сказать.',
];
window.vopr.rsh='ВЗРЫВНОЙ — относящийся к взрывам. По контексту подразумевается ВЗРЫВЧАТЫЙ (вещества всегда ВЗРЫВЧАТЫЕ, а не ВЗРЫВНЫЕ).';

AtoB();
 
})();
