(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ВРАЖДЕБНЫЙ нужно употребить слово ВРАЖЕСКИЙ?'+
	'<br/>';
window.vopr.ver=[
	'ВРАЖДЕБНАЯ оборона была сломлена, и войска вошли в город.',
];
window.vopr.nev=[
	'Огромный ВРАЖДЕБНЫЙ мир, пугающий своей неизвестностью, осваивается ребёнком шаг за шагом.',
	'Неожиданно ВРАЖДЕБНЫЙ тон удивил и огорчил приятелей.',
	'Компьютеры нередко рассматриваются в современном кинематографе как ВРАЖДЕБНАЯ человеку сила.',
];
window.vopr.rsh='ВРАЖДЕБНЫЙ — исполненный вражды, неприязненный. По контексту подразумевается ВРАЖЕСКАЯ оборона.';

AtoB();

})();
