<<<<<<< HEAD
(function() {
	'use strict';
	chas2.task.setTask({
		text: 'В каком предложении вместо слова ВРАЖДЕБНЫЙ нужно употребить слово ВРАЖЕСКИЙ?' + '<br/>',
		answers: [
			'ВРАЖДЕБНАЯ оборона была сломлена, и войска вошли в город.',
		],
		wrongAnswers: [
			'Огромный ВРАЖДЕБНЫЙ мир, пугающий своей неизвестностью, осваивается ребёнком шаг за шагом.',
			'Неожиданно ВРАЖДЕБНЫЙ тон удивил и огорчил приятелей.',
			'Компьютеры нередко рассматриваются в современном кинематографе как ВРАЖДЕБНАЯ человеку сила.',
		],
		analys: 'ВРАЖДЕБНЫЙ — исполненный вражды, неприязненный. По контексту подразумевается ВРАЖЕСКАЯ оборона.',
	});
	AtoB();

=======
(function(){'use strict';

window.vopr.txt='В каком предложении вместо слова ВРАЖДЕБНЫЙ нужно употребить слово ВРАЖЕСКИЙ?'+
	'<br/>';
window.vopr.ver=[
	'ВРАЖДЕБНАЯ оборона была сломлена, и войска вошли в город.',
];
window.vopr.nev=[
	'Огромный ВРАЖДЕБНЫЙ мир, пугающий своей неизвестностью, осваивается ребёнком шаг за шагом.',
	'Неожиданно ВРАЖДЕБНЫЙ тон удивил и огорчил приятелей.',
	'Компьютеры нередко рассматриваются в современном кинематографе как ВРАЖДЕБНАЯ человеку сила.',
];
window.vopr.rsh='ВРАЖДЕБНЫЙ — исполненный вражды, неприязненный. По контексту подразумевается ВРАЖЕСКАЯ оборона.';

AtoB();

>>>>>>> 02bf59a5fbe0a89e484fb8b8c2057d1f3fa48ddb
})();
