(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ИСПОЛНИТЕЛЬСКИЙ нужно употребить слово ИСПОЛНИТЕЛЬНЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Одна из ветвей государственной власти — ИСПОЛНИТЕЛЬСКАЯ.',
];
window.vopr.nev=[
	'Наша страна может гордиться цирковым ИСПОЛНИТЕЛЬСКИМ искусством.',
	'Каждый настоящий музыкант должен интересоваться вековыми традициями народной и классической ИСПОЛНИТЕЛЬСКОЙ культуры.',
	'ИСПОЛНИТЕЛЬСКОЕ мастерство актёра достойно восхищения.',
];
window.vopr.rsh='';

AtoB();
 
})();
