(function() {
	'use strict';
	chas2.task.setTask({
		text: 'В каком предложении вместо слова ИСПОЛНИТЕЛЬСКИЙ нужно употребить слово ИСПОЛНИТЕЛЬНЫЙ?' +
			'<br/>',
		answers: [
			'Одна из ветвей государственной власти — ИСПОЛНИТЕЛЬСКАЯ.',
		],
		wrongAnswers: [
			'Наша страна может гордиться цирковым ИСПОЛНИТЕЛЬСКИМ искусством.',
			'Каждый настоящий музыкант должен интересоваться вековыми традициями народной и классической ИСПОЛНИТЕЛЬСКОЙ культуры.',
			'ИСПОЛНИТЕЛЬСКОЕ мастерство актёра достойно восхищения.',
		],
		analys: '',
	});
	AtoB();

})();
