(function() {
	retryWhileError(function() {
		'use strict';
		let num1 = sl(1.1, 10, 0.1);
		let num2 = slKrome(num1, 1.1, 10, 0.1);
		let num3 = num1 * num2;
		NAtask.setEvaluationTask({
			expr: '(sqrt(' + num1 + ')' + ['+', '-'].iz() + 'sqrt(' + num2 + '))^2/(' + sl(2, 10) + ['+', '-'].iz() + sl(2,	10) + 'sqrt(' + num3 + '))',
			//forbiddenAnswers: [0],
			authors: ['Суматохина Александра'],
		});
	}, 10000);
})();
//26750 26751 62647 541256 26929 62583 62585 62587 62589 62591 62593 62595 62597 62599 62601 62603 62607 62609 62611 62613 62615 62617 62619 62621 62623 62625 62627 62629 62631 62633 62635 62637 62639 62641 62643 62645
