//Задача 21 ЕГЭ-база (smekalka): Маша и Медведь
(function(){
 'use strict';
 retryWhileError(function(){
  NAinfo.requireApiVersion(0, 2);

  var C = 5 * slKrome([11, 17, 20, 22, 23, 24, 28, 32], 12, 52);
  NAtask.setTask({
   text: 'Маша и Медведь съели ' + chislitlx(C, 'печенье', '$') + ' и банку варенья, начав и закончив одновременно. Сначала Маша ела варенье, а Медведь — печенье, но в какой-то момент они поменялись. Медведь и то и другое ест в два раза быстрее Маши. Сколько печений съел Медведь, если варенья они съели поровну?',
   answers: 4 * C / 5,
 });
 }, 1000);
})();
//10556397
//Открытый банк заданий, A113ED (задание 21, ЕГЭ-база)
//chas-ege-selena
