//Задача 21 ЕГЭ-база (smekalka): кузнечик на прямой
(function(){
 'use strict';
 retryWhileError(function(){
  NAinfo.requireApiVersion(0, 2);

  var n = slKrome([4, 5, 6, 7, 8, 9, 10, 11, 12], 2, 60);
  NAtask.setTask({
   text: 'Кузнечик прыгает вдоль координатной прямой в любом направлении на единичный отрезок за прыжок, делая первый прыжок из начала координат. Сколько существует различных точек на координатной прямой, в которых кузнечик может оказаться, совершив ровно ' + chislitlx(n, 'прыжок', '$v') + '?',
   answers: n + 1,
 });
 }, 1000);
})();
//3790491
//Открытый банк заданий, 39D69B (задание 21, ЕГЭ-база)
//chas-ege-selena
