//Задача 21 ЕГЭ-база (smekalka): дом: этажи-квартиры-подъезды
(function(){
 'use strict';
 retryWhileError(function(){
  NAinfo.requireApiVersion(0, 2);

  var pr = [2, 3, 5, 7, 11, 13, 17, 19, 23].iz(3);
  var N = pr[0] * pr[1] * pr[2];
  genAssert(N != 105 && N != 110, 'эти числа заняты прототипами банка');
  var p = Math.min(pr[0], pr[1], pr[2]);
  NAtask.setTask({
   text: 'Во всех подъездах дома одинаковое число этажей, а на всех этажах одинаковое число квартир. При этом число этажей в доме больше числа квартир на этаже, число квартир на этаже больше числа подъездов, а число подъездов больше одного. Сколько подъездов в доме, если всего в нём ' + chislitlx(N, 'квартира', '$') + '?',
   answers: p,
 });
 }, 1000);
})();
//9826449
//Открытый банк заданий, 95F091 (задание 21, ЕГЭ-база)
//chas-ege-selena
