(function() {

var m=[
	['1497','Судебник Ивана III. Норма Юрьева дня – 2 недели.'],
	['1550','Судебник Ивана IV. Юрьев день – 1 день.'],
	['1581','Отмена Юрьева дня («Заповедные лета»).'],
	['1597',' Указ при царе Федоре Ивановиче о 5-летнем сыске беглых крестьян («Урочные лета»).'],
	['1649','«Соборное Уложение» царя Алексея Михайловича. Бессрочный сыск беглых крестьян. Юридическое оформление крепостного права.'],
		].iz();

window.vopr.txt='Назовите год, в котором произошло событие:<br/><br/>'+
	m[1];
window.vopr.ver=[m[0]];
window.vopr.vrn=window.vopr.vrn_ist;
})();
