 
(function() {
	'use strict';
	NAinfo.requireApiVersion(0, 2);
	let start, pr = [],
		finish;
	do {
		start = sluchch(100000, 600000, 10000);
		pr[0] = sluchch(1, 100);
		pr[1] = sluchch(1, pr[0]);
		pr[2] = sluchch(1, pr[1]);
		pr[3] = 100 - pr[0] - pr[1] - pr[2];
		finish = sluchch(1000000, 2000000, 10000);
	} while (!(finish * (pr[3] / 100)).isZ() || (pr[3] <= 0));

	let chisl = [];
	let k = 0;
	for (let i = 0; i < 3; i++) {
			chisl[i] = sluchch(k, 2);
			if(chisl[i]==0)
			k++;
			if(i==2&&!chisl.includes(0,0))
			chisl[2]=0;
		switch (chisl[i]) {
		case 0:
			if ((pr[i] / 100 * start).isZ()) {
				pr[i] = `$${(pr[i]/100)*start}$ рублей`;
				break;
			} else
				continue;
		case 1:
			pr[i] = `$${pr[i]/100}$ уставного капитала`;
			break;
		case 2:
			pr[i] = `$${pr[i]}\\%$ уставного капитала`;
			break;
		}
	}
	let person = [
		[`Петя`, `Коля`, `Вася`, `Ваня`, `Саша`, `Женя`, `Никита`, `Арсений`, `Антон`, `Яков`,
			`Рома`, `Олег`, `Кирилл`, `Данил`, `Даниил`, `Арик`, `Ярик`, `Фома`, `Дима`, `Артём`, `Матвей`, `Максим`, `Игорь`,
			0, `внёс`
		],
		[`Алёна`, `Саша`, `Женя`, `Вика`, `Арина`, `Маша`, `Лена`, `Оля`, `Катя`, `Марина`, `Аня`, `Наташа`,
			`Ирина`, `Настя`, `Ирма`, `Кристина`, `Ира`, `Мила`, `Тома`, `Любовь3`, `Вера`, `Надежда`, `Снежана`, 1, `внесла`,
		],
	].iz();
	let vklad = person.pop();
	let k0 = person.pop();
	person = sklonlxkand(person.iz(4));
	NAtask.setTask({
		text: `${person[0].ie}, ${person[1].ie}, ${person[2].ie} и ${person[3].ie} учредили компанию с уставным капиталом $${start}$ рублей. ` +
			`${person[0].ie} ${vklad} ${pr[0]}, ` +
			`${person[1].ie} - ${pr[1]}, ${person[2].ie} - ${pr[2]}, а оставшуюся часть капитала ${vklad} ${person[3].ie}. ` +
			`Учредители договорились делить ежегодную прибыль пропорционально внесенному в уставной капитал вкладу.` +
			` Какая сумма от прибыли $${finish}$ рублей причитается ${person[3].de}? Ответ дайте в рублях.`,
		answers: finish * (pr[3] / 100),
		analys: `${person[1].ie} внес  $\\cfrac{${(start*pr[1])/100}}{${start}}\\cdot100\%=${(start*pr[1])/(100*start)}\%$ $ = ${pr[1]}\\%$ уставного капитала. ` +
			`Тогда ${person[3].ie} внес $100\\%$ − $${pr[0]}\\%$ - $${pr[1]}\\%$ - $${pr[2]}\\%$ = $${pr[3]}\\%$ уставного капитала. ` +
			`Таким образом, от прибыли $${finish}$ рублей ${person[3].de} причитается $${pr[3]/100} · ${finish} = ${finish * (pr[3] / 100)}$ рублей.`,
	});
})();
//Обзад 99570
