(function(){
NAinfo.requireApiVersion(0, 0);

NAtask.setTwoStatementTask(
	[
	    ["Колебание на нити груза, один раз отведённого от положения равновесия и отпущенного.", 0,],
	    ["Колебание маятника, один раз отведённого от положения равновесия и отпущенного.", 0,],
	    ["Колебание на нити груза после однократного его отклонения от положения равновесия.", 0,],
	    ["Колебание маятника после однократного его отклонения от положения равновесия.", 0,],
	    ["Колебание качелей, раскачиваемых человеком, стоящим на земле.",1,],
	    ["Колебание диффузора громкоговорителя во время его работы.",1,],
	],
	[[
	    "Какое из перечисленных колебаний является вынужденным?",
	    "Какое из перечисленных колебаний не является свободным?",
	],[
	    "Какое из перечисленных колебаний является свободным?",
	    "Какое из перечисленных колебаний не является вынужденным?",
    ]]
);

})();
