window.latbukv=["A","B","C","D","F","G","H","J","L","M","N","P","R","S","T","Q","U","W","X","Y","Z"];

window.rusbukv=["А","Б","В","Г","Д","Е","Ё","Ж","И","Й","К","Л","М","Н","П","Р","С","Т","У","Ф","Х","Ц","Ч","Ш","Щ","Ъ","Ы","Ь","Э","Ю","Я"];

window.moneta=['орёл','решка'];

window.razy=['ни разу','один раз','дважды','трижды','четырежды','пятикратно','шестикратно','семикратно','восьмикратно','девятикратно','десятикратно'];

window.kachestva={};
window.kachestva.ie=['безопасность','комфорт','функциональность','качество','внешний вид','простота ремонта','надёжность','гарантийный срок','скорость запуска','настраиваемость'];

window.tovary={};
window.tovary.ie=['автомобиль'	,'кофеварка'	,'чайник'	,'ноутбук'		,'бензопила'	,'СВЧ-печь'		,'велосипед'	,'садовый насос'	];
window.tovary.rm=['автомобилей'	,'кофеварок'	,'чайников'	,'ноутбуков'	,'бензопил'		,'СВЧ-печей'	,'велосипедов'	,'садовых насосов'	];

window.dlina={};
window.dlina.m= [/*7467.6, 			*/	1066.8,		185.2,			1852,				1609.34,				201.16		];
window.dlina.pm=[/*'русских милях',	*/	'вёрстах',	'кабельтовах',	'морских милях',	'американских милях',	'фурлонгах'	];
window.dlina.ie=[/*'русская миля',	*/	'верста',	'кабельтов',	'морская миля',		'американская миля',	'фурлонг'	];
window.dlina.rm=[/*'русских миль',	*/	'вёрст',	'кабельтовых',	'морских миль',		'американских миль',	'фурлонгов'	];

window.imenaj={};
window.imenaj.ie=['Анастасия','Юлия','Елена','Ольга','Яна','Олеся','Кристина','Вероника','Элеонора','Дарья','Мария','Екатерина','Софья','Наталия','Надежда','Александра'];

window.otchestvaj={};
window.otchestvaj.ie=['','Ивановна','Петровна','Фёдоровна','Васильевна','Анатольевна','Николаевна','Сергеевна','Игоревна','Михайловна','Владимировна','Олеговна','Степановна','Юрьевна','Александровна','Алексеевна','','','','']

window.profesj={};
window.profesj.ie=['суровая воронежская хакерша','','программистка','веб-дизайнер','аспирантка','скромный библиотекарь','блондинка','студентка','школьница','комсомолка, спортсменка, отличница и, наконец, просто красавица','']

window.deistviaj=['купила','получила в наследство','получила в подарок','нашла','приобрела','раздобыла'];

window.transportm={};
window.transportm.ie=['"Запорожец"'	,'"Москвич"'	,'автомобиль'	,'грузовик'	,'велосипед'	,'доисторический омнибус','автобус'];
window.transportm.r2=['"Запорожца"'	,'"Москвича"'	,'автомобиля'	,'грузовика','велосипеда'	,'доисторических омнибуса','автобуса'];
window.transportm.re=['"Запорожца"'	,'"Москвича"'	,'автомобиля'	,'грузовика','велосипеда'	,'доисторического омнибуса','автобуса'];
window.transportm.te=['"Запорожцем"','"Москвичом"','автомобилем','грузовиком','велосипедом','доисторическим омнибусом','автобусом'];

window.pifagtr=[[3,4,5],[5,12,13],[8,15,17],[7,24,25]];

window.mesiacy={};
window.mesiacy.re=['января','февраля','марта','апреля','мая','июня','июля','августа','сентября','октября','ноября','декабря'];
window.mesiacy.dni=[31,28,31,30,31,30,31,31,30,31,30,31];

window.valuta={};
window.valuta.re=['доллара','евро','фунта стерлингов'];

var om={};
om.eda={};
om.eda.ie=['сырок'	,'шоколадка'	,'яблоко'	,'груша'	,'упаковка сока'	,'бутерброд'	,'бутылка газировки'	,'батон'	,'буханка хлеба'	];
om.eda.re=['сырка'	,'шоколадки'	,'яблока'	,'груши'	,'упаковки сока'	,'бутерброда'	,'бутылки газировки'	,'батона'	,'буханки хлеба'	];
om.eda.ve=['сырок'	,'шоколадку'	,'яблоко'	,'грушу'	,'упаковку сока'	,'бутерброд'	,'бутылку газировки'	,'батон'	,'буханку хлеба'	];
om.eda.rm=['сырков'	,'шоколадок'	,'яблок'	,'груш'		,'упаковок сока'	,'бутербродов'	,'бутылок газировки'	,'батонов'	,'буханок хлеба'	];

om.korabli={};
om.korabli.ie=['корабль'	,'круизный лайнер'	,'прогулочное судно'	,'теплоход'		,'пароход'	,'атомоход'		];
om.korabli.pe=['корабле'	,'круизном лайнере'	,'прогулочном судне'	,'теплоходе'	,'пароходе'	,'атомоходе'	];

om.meltov={};
om.meltov.ie=['фонарик'		,'флакон шампуня'	,'флэшка'	,'компакт-диск'		,'сувенир'		,'матрёшка'	,'магнит на холодидьник'	,'сборник тестов для подготовки к ЕГЭ'		,'тетрадь'	,'учебник'		,'цветочный горшок'		];
om.meltov.im=['фонарики'	,'флаконы шампуня'	,'флэшки'	,'компакт-диски'	,'сувениры'		,'матрёшки'	,'магниты на холодидьник'	,'сборники тестов для подготовки к ЕГЭ'		,'тетради'	,'учебники'		,'цветочные горшки'		];
om.meltov.re=['фонарика'	,'флакона шампуня'	,'флэшки'	,'компакт-диска'	,'сувенира'		,'матрёшки'	,'магнита на холодидьник'	,'сборника тестов для подготовки к ЕГЭ'		,'тетради'	,'учебника'		,'цветочных горшка'		];
om.meltov.ve=['фонарик'		,'флакон шампуня'	,'флэшку'	,'компакт-диск'		,'сувенир'		,'матрёшку'	,'магнит на холодидьник'	,'сборник тестов для подготовки к ЕГЭ'		,'тетрадь'	,'учебник'		,'цветочный горшок'		];
om.meltov.rm=['фонариков'	,'флаконов шампуня'	,'флэшек'	,'компакт-дисков'	,'сувениров'	,'матрёшек'	,'магнитов на холодидьник'	,'сборников тестов для подготовки к ЕГЭ'	,'тетрадей'	,'учебников'	,'цветочных горшков'	];

om.sroki={};
om.sroki.re=['недели'	,'декады'	,'месяца'	];
om.sroki.ve=['неделю'	,'декаду'	,'месяц'	];
om.sroki.rm=['недель'	,'декад'	,'месяцев'	];

om.uchrezhd={};
om.uchrezhd.ie=['офис'	,'канцелярия'	,'секретариат'	,'министерство'	,'ведомство'	,'Росообрнадзор'	,'Минобрнауки'	];
om.uchrezhd.ve=['офис'	,'канцелярию'	,'секретариат'	,'министерство'	,'ведомство'	,'Росообрнадзор'	,'Минобрнауки'	];
om.uchrezhd.pe=['офисе'	,'канцелярии'	,'секретариате'	,'министерстве'	,'ведомстве'	,'Росообрнадзоре'	,'Минобрнауки'	];

om.denned={};
om.denned.ie=		['воскресенье'	,'понедельник'	,'вторник'	,'среда'	,'четверг'	,'пятница'	,'суббота'	];
om.denned.ve=		['воскресенье'	,'понедельник'	,'вторник'	,'среду'	,'четверг'	,'пятницу'	,'субботу'	];
om.denned.pg=[];
om.denned.pg['в']=	['в'			,'в'			,'во'		,'в'		,'в'		,'в'		,'в'		];

om.igrkosti=[];
om.igrkosti[2]=[0,0,1,2,3,4,5,6,5,4,3,2,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
om.igrkosti[3]=[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0];
(function() {
	for(var i1=1;i1<=6;i1++)
		for(var i2=1;i2<=6;i2++)
			for(var i3=1;i3<=6;i3++)
				om.igrkosti[3][i1+i2+i3]++;
})();

om.strany={};
om.strany.ie=['Россия'	,'Белоруссия'	,'Китай'	,'ЮАР'	,'Эквадор'	,'Венесуэла'	,'Куба'	,'Австралия'	,'Австрия'	,'Бельгия'	,'Англия'	,'Германия'	,'Польша'	,'Сербия'	,'Чехия'	,'Словакия'	,'Словения'	,'Израиль'	,'Бразилия'	,'Мексика'	];
om.strany.re=['России'	,'Белоруссии'	,'Китая'	,'ЮАР'	,'Эквадора'	,'Венесуэлы'	,'Кубы'	,'Австралии'	,'Австрии'	,'Бельгии'	,'Англии'	,'Германии'	,'Польши'	,'Сербии'	,'Чехии'	,'Словакии'	,'Словении'	,'Израиля'	,'Бразилии'	,'Мексики'	];

om.sportparn={};
om.sportparn.ie=['шахматы'	,'вольная борьба'	,'настольный теннис'	,'бадминтон'	,'шашки'	];
om.sportparn.pe=['шахматам'	,'вольной борьбе'	,'настольному теннису'	,'бадминтону'	,'шашкам'	];


om.sport={};
om.sport.ie=['гимнастика'	,'вольная борьба'	,'лёгкая атлетика'	,'тяжёлая атлетика'	];
om.sport.pe=['гимнастике'	,'вольной борьбе'	,'лёгкой атлетике'	,'тяжёлой атлетике'	];

om.izdsteklo={};
om.izdsteklo.rm=['витрин','оконных рам','аквариумов','книжных полок','террариумов'];

om.znamenat=[2,4,5,8,10,20,25,100,200];

om.zhidkost={};
om.zhidkost.re=['воды','ртути','жидкости','раствора','бензина','керосина','метилового спирта','газировки','уксуса','нефти'];

om.ravno=['равен','равна','равно','равны'];
om.sostavl=['составляет','составляет','составляет','составляют'];
om.vyrazh=['выраженный','выраженная','выраженное','выраженные'];
om.utochn=['','','','','','при этом ','известно, что '];
om.utochn2=[', при этом ',', а ',', '];

om.goroda={};
om.goroda.ie=['Воронеж'		,'Москва','Санкт-Петербург'	,'Казань','Сочи','Семилуки'		,'Хабаровск'	,'Магадан'	,'Красноярск'];
om.goroda.pe=['Воронеже'	,'Москве','Санкт-Петербурге','Казани','Сочи','Семилуках'	,'Хабаровске'	,'Магадане'	,'Красноярске'];

om.porchisl={};
om.porchisl[1]={};
om.porchisl[1].i=['первый','первая','первое','первые'];
om.porchisl[2]={};
om.porchisl[2].i=['второй','вторая','второе','вторые'];
om.porchisl[3]={};
om.porchisl[3].i=['третий','третья','третье','третьи'];
om.porchisl[4]={};
om.porchisl[4].i=['четвёртый','четвёртая','четвёртое','четвёртые'];
om.porchisl[5]={};
om.porchisl[5].i=['пятый','пятая','пятое','пятые'];
om.porchisl[6]={};
om.porchisl[6].i=['шестой','шестая','шестое','шестые'];
om.porchisl[7]={};
om.porchisl[7].i=['седьмой','седьмая','седьмое','седьмые'];
om.porchisl[8]={};
om.porchisl[8].i=['восьмой','восьмая','восьмое','восьмые'];
om.porchisl[9]={};
om.porchisl[9].i=['девятый','девятая','девятое','девятые'];
om.porchisl[10]={};
om.porchisl[10].i=['деcятый','деcятая','деcятое','деcятые'];
om.porchisl[11]={};
om.porchisl[11].i=['одиннадцатый','одиннадцатая','одиннадцатое','одиннадцатые'];
om.porchisl[12]={};
om.porchisl[12].i=['двенадцатый','двенадцатая','двенадцатое','двенадцатые'];
om.porchisl[13]={};
om.porchisl[13].i=['тринадцатый','тринадцатая','тринадцатое','тринадцатые'];
om.porchisl[14]={};
om.porchisl[14].i=['четырнадцатый','четырнадцатая','четырнадцатое','четырнадцатые'];
om.porchisl[15]={};
om.porchisl[15].i=['пятнадцатый','пятнадцатая','пятнадцатое','пятнадцатые'];
om.porchisl[16]={};
om.porchisl[16].i=['шестнадцатый','шестнадцатая','шестнадцатое','шестнадцатые'];
om.porchisl[17]={};
om.porchisl[17].i=['семнадцатый','семнадцатая','семнадцатое','семнадцатые'];
om.porchisl[18]={};
om.porchisl[18].i=['восемнадцатый','восемнадцатая','восемнадцатое','восемнадцатые'];
om.porchisl[19]={};
om.porchisl[19].i=['девятнадцатый','девятнадцатая','девятнадцатое','девятнадцатые'];
om.porchisl[20]={};
om.porchisl[20].i=['двадцатый','двадцатая','двадцатое','двадцатые'];

om.otvdayte=['выразите','дайте','приведите','запишите'];
om.otvnaydite=['найдите','определите','вычислите'];

om.metally={};
om.metally.re=['меди','алюминия','чугуна','железа','стали','никеля','хрома'];


om.mesiacy=window.mesiacy;
om.tovary=window.tovary;
om.rusbukv=window.rusbukv;
om.latbukv=window.latbukv;
om.imenaj=window.imenaj;
om.transportm=window.transportm;
om.pifagtr=window.pifagtr;

om.toplivo=['топливо','бензин','дизель','газ','керосин','солярка'];
om.mezhgortrans=['автобус','поезд'];
om.naspunkt=['пункт','населённый пункт','город','городок','ПГТ'/*,'деревня','село','хутор','посёлок','инноград','наукоград'*/];
om.stroymat=['пенобетон','бетон',/*'брус','шлак','песок','щебень','гранит','известняк','песчаник','камень','гравий'*/];
om.izmergruz=['тонна','кубометр'];
om.stroenmal=['гараж',/*'дом','дача','магазин'*/];

om.edizm={};
om.edizm.dlina=[
	['метр',1],
	['километр',1000],
	['дециметр',0.1],
	['сантиметр',0.01],
	['миллиметр',0.001],
];
