(function () {
	'use strict';
	retryWhileError(function () {
		NAinfo.requireApiVersion(0, 2);
		let key = '506361';
		let preference = ['findTrue', 'findFalse'];
		let rand = getSelectedPreferenceFromList(key, preference);
		let nCorrect = sl(1, 3);
		let nWrong = 4 - nCorrect;

		let sport = ['бег на 100 м', 'плавание', 'прыжки в длину', 'метание копья', 'метание диска', 'прыжки в высоту', 'прыжки в длину',].iz();

		let correct = [
			`Если результат спортсмена, участвующего в Олимпийских играх, не является олимпийским рекордом, то он не является и мировым рекордом.`,
			`Если спортсмен, участвующий в Олимпийских играх, установил мировой рекорд в ${sport}, то его результат является и олимпийским рекордом.`,
			`Мировой рекорд автоматически становится олимпийским, если установлен на Олимпиаде.`,
			`Отсутствие олимпийского рекорда исключает наличие мирового рекорда.`
		];
		let wrong = [
			`Если результат спортсмена, участвующего в Олимпийских играх, является олимпийским рекордом, то он является и мировым рекордом.`,
			`Если результат спортсмена, участвующего в Олимпийских играх, не является мировым рекордом, то он не является и олимпийским рекордом.`,
			`Олимпийский рекорд всегда совпадает с мировым.`,
			`Мировой рекорд может быть хуже олимпийского.`
		];

		NAtask.setTask({
			text: `Если спортсмен, участвующий в Олимпийских играх, установил мировой рекорд, то его результат является и олимпийским рекордом.` +
				` Выберите утверждения, которые ` + (rand ? 'неверны' : 'верны') + `. В ответе укажите номера выбранных утверждений без пробелов, запятых и других дополнительных символов. Если ответов несколько, записывайте их номера в порядке возрастания.`,
			answers: rand ? wrong : correct,
			wrongAnswers: rand ? correct : wrong,
			preference: preference,
		});
		AtoB2(nCorrect, nWrong);
	}, 1000);
})();
// https://mathb-ege.sdamgia.ru/problem?id=506361
