(function(){
	NAinfo.requireApiVersion(0, 0);
	var v1=sl1(); //Частота или период
	var v2=sl1(); //Потенциальная или кинетическая
    NAtask.setTask({
		text:"Тело, подвешенное на пружине, совершает гармонические колебания с "+["частотой $\\nu$","периодом $T$"][v1]+". "+
			"C "+["какой частотой","каким периодом"][v1]+" изменяется "+["потенциальная","кинетическая"][v2]+" энергия "+
			["упругой деформации пружины","тела"][v2]+"?",
		answers:["$2\\nu$","$\\frac{T}{2}$"][v1],
		wrongAnswers:[["$\\nu$","$\\frac{\\nu}{2}$","$\\frac{3\\nu}{2}$"],["$T$","$2T$","$\\frac{3T}{2}$"]][v1]
	});
	AtoB();
})();

