(function(){

var m=[
	['10.07.1918','Первая советская конституция. Принята на V Всероссийском съезде Советов РСФСР.'],
	['31.01.1924','Первая конституция СССР. Утверждена на II Всесоюзном съезде Советов СССР.'],
	['05.12.1936','Конституция «победившего социализма». Утверждена Чрезвычайным VIII съездом Советов СССР.'],
	['07.10.1977','Конституция «Развитого социализма». Принята на внеочередной седьмой сессии Верховного Совета СССР девятого созыва.'],
	['12.12.1993','Конституция РФ. Принята Всенародным голосованием (Референдумом). За нее проголосовало порядка 58 % участников Референдума.'/*' Конституция вступила в силу в день её опубликования в «Российской газете» – 25 декабря 1993 г.'*/],
		].iz();

window.vopr.txt='Назовите дату (с точностью до дня), когда была принята '+
	m[1];
window.vopr.ver=[m[0]];
window.vopr.vrn=window.vopr.vrn_ist;
})();
