(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ДОВЕРЧИВЫЙ нужно упо­тре­бить слово ДОВЕРИТЕЛЬНЫЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'От­но­ше­ния между на­чаль­ни­ком и его под­чинённым по­сте­пен­но при­об­ре­ли более ДОВЕРЧИВЫЙ ха­рак­тер.',

];
window.vopr.nev=[
	'Среди ДОВЕРЧИВЫХ людей не­ред­ко встре­ча­ют­ся те, кто по­пла­тил­ся за свою до­вер­чи­вость.',
	'Это было су­ще­ство ДОВЕРЧИВОЕ, роб­кое и сла­бое.',
	'Бра­тья его были на­столь­ко на­ив­ны­ми и ДОВЕРЧИВЫМИ, что об­ма­нуть их было со­всем не­труд­но.',
];
window.vopr.rsh='ДО­ВЕР­ЧИ­ВЫЙ — легко до­ве­ря­ю­щий. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ДО­ВЕ­РИ­ТЕЛЬ­НЫЙ.';

AtoB();
 
})();
