(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ПРАК­ТИ­ЧЕ­СКИЙ нужно упо­тре­бить ПРАК­ТИЧ­НЫЙ?;<br/>';
 +'<br/>';
window.vopr.ver=[
	'Ма­ри­на Ва­си­льев­на очень взвол­но­ва­лась, но всё-таки при­слу­ша­лась к муд­рой и ПРАК­ТИ­ЧЕ­СКОЙ своей при­я­тель­ни­це.',

];
window.vopr.nev=[
	'Важ­ное зна­че­ние для даль­ней­шей жизни имеют ПРАК­ТИ­ЧЕ­СКИЕ на­вы­ки, при­об­ретённые в ран­нем дет­стве.',
	'Вих­рев в ПРАК­ТИ­ЧЕ­СКОЙ жизни от­ли­чал­ся ред­кост­ным про­сто­ду­ши­ем.',
	'Си­сте­ма ПРАК­ТИ­ЧЕ­СКИХ за­ня­тий ши­ро­ко рас­про­стра­не­на в выс­шей школе.',
];
window.vopr.rsh='ПРАК­ТИ­ЧЕ­СКИЙ — за­ни­ма­ю­щий­ся при­ме­не­ни­ем каких-либо зна­ний на деле, раз­ви­ва­ю­щий уме­ния, зна­ния, опыт в сфере какой-либо де­я­тель­но­сти. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ПРАК­ТИЧ­НЫЙ.';

AtoB();
 
})();
