(function(){'use strict';
 
window.vopr.txt=' В каком пред­ло­же­нии вме­сто слова ЕДИНИЧНЫЙ нужно упо­тре­бить слово ЕДИНСТВЕННЫЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'Дмит­рий оста­вал­ся самым весёлым, а точ­нее, ЕДИНИЧНЫМ че­ло­ве­ком в груп­пе, ко­то­рый без конца шутил.',

];
window.vopr.nev=[
	'ЕДИНИЧНЫЙ слу­чай в экс­пе­ри­мен­те не под­твер­жда­ет ги­по­те­зу.',
	'Этот слу­чай ока­зал­ся да­ле­ко не ЕДИНИЧНЫМ, и почти еже­год­но он по­вто­ря­ет­ся.',
	'Нужно ста­рать­ся об­ра­щать вни­ма­ние на яв­ле­ние в целом, а не на ЕДИНИЧНЫЕ его про­яв­ле­ния.',
];
window.vopr.rsh='ЕДИ­НИЧ­НЫЙ че­ло­век — от­дель­ный или ред­кий че­ло­век. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ЕДИН­СТВЕН­НЫЙ че­ло­век. ';

AtoB();
 
})();
