(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова КОМАНДИРОВАННЫЙ нужно упо­тре­бить слово КОМАНДИРОВОЧНЫЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'КОМАНДИРОВАННОЕ удо­сто­ве­ре­ние ин­же­нер по­ло­жил на стол.',

];
window.vopr.nev=[
	'Нас по­се­ли­ли в доме для КОМАНДИРОВАННЫХ.',
	'Со мною в го­сти­ни­це жил КОМАНДИРОВАННЫЙ — при­ят­ный че­ло­век с рыжей бо­ро­дой.',
	'Про­сти­те, как вы по­па­ли на этот завод? Вы КОМАНДИРОВАННЫЙ?',
];
window.vopr.rsh='КО­МАН­ДИ­РО­ВАН­НЫЙ — че­ло­век, на­прав­лен­ный в ко­ман­ди­ров­ку. По кон­тек­сту под­ра­зу­ме­ва­ет­ся КО­МАН­ДИ­РО­ВОЧ­НЫЙ.';

AtoB();
 
})();
