(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ВРАЖДЕБНЫЙ нужно упо­тре­бить слово ВРАЖЕСКИЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'ВРАЖДЕБНАЯ обо­ро­на была слом­ле­на, и вой­ска вошли в город.',

];
window.vopr.nev=[
	'Огром­ный ВРАЖДЕБНЫЙ мир, пу­га­ю­щий своей не­из­вест­но­стью, осва­и­ва­ет­ся ребёнком шаг за шагом.',
	'Не­ожи­дан­но ВРАЖДЕБНЫЙ тон уди­вил и огор­чил при­я­те­лей.',
	'Ком­пью­те­ры не­ред­ко рас­смат­ри­ва­ют­ся в со­вре­мен­ном ки­не­ма­то­гра­фе как ВРАЖДЕБНАЯ че­ло­ве­ку сила.',
];
window.vopr.rsh='ВРАЖДЕБНЫЙ — ис­пол­нен­ный враж­ды, не­при­яз­нен­ный. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ВРА­ЖЕ­СКАЯ обо­ро­на.';

AtoB();
 
})();
