(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ГУ­МАН­НЫЙ нужно упо­тре­бить ГУ­МА­НИ­ТАР­НЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Во время пе­ре­го­во­ров участ­ни­ка­ми встре­чи об­суж­де­ны ГУ­МАН­НЫЕ во­про­сы.',
];
window.vopr.nev=[
	'Са­мы­ми ГУ­МАН­НЫ­МИ про­фес­си­я­ми на земле яв­ля­ют­ся те, от ко­то­рых за­ви­сит ду­хов­ная жизнь и фи­зи­че­ское здо­ро­вье че­ло­ве­ка.',
	'ГУ­МАН­НЫЕ за­ко­ны воз­мож­ны толь­ко в зре­лом об­ще­стве.',
	'ГУ­МАН­НОЕ от­но­ше­ние к детям озна­ча­ет пре­жде всего по­ни­ма­ние ду­хов­ных уси­лий ребёнка, ува­жи­тель­ное от­но­ше­ние к этим ис­ка­ни­ям и не­на­вяз­чи­вую по­мощь.',
];
window.vopr.rsh='ГУМАННЫЙ — на­прав­лен­ный на благо дру­гих; че­ло­ве­ко­лю­би­вый и от­зыв­чи­вый. ГУМАНИТАРНЫЙ — от­но­ся­щий­ся к изу­че­нию об­ще­ства, куль­ту­ры и ис­то­рии на­ро­да в от­ли­чие от есте­ствен­ных и тех­ни­че­ских наук.';

AtoB();
 
})();
