(function(){'use strict';
 
window.vopr.txt=' В каком предложении вместо слова ВЕЛИКИЙ нужно употребить ВЕЛИЧЕСТВЕННЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Высокая, стройная, грациозная и ВЕЛИКАЯ, Елена держалась всегда необыкновенно прямо, и это придавало ей царственный вид.',
];
window.vopr.nev=[
	'Литература — ВЕЛИКОЕ достояние народа.',
	'Народу было ВЕЛИКОЕ множество, как будто весь город пожелал увидеть поэта и услышать его удивительный голос.',
	'Каждый ВЕЛИКИЙ поэт является выразителем духа народа, его истории.',
];
window.vopr.rsh='ВЕЛИКИЙ — превышающий обычную меру, сравнительно с другими. По контексту подразумевается ВЕЛИЧЕСТВЕННЫЙ.';

AtoB();
 
})();
