(function(){'use strict';
 
window.vopr.txt=' В каком пред­ло­же­нии вме­сто слова ВЕ­ЛИ­КИЙ нужно упо­тре­бить ВЕ­ЛИ­ЧЕ­СТВЕН­НЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Вы­со­кая, строй­ная, гра­ци­оз­ная и ВЕ­ЛИ­КАЯ, Елена дер­жа­лась все­гда не­обык­но­вен­но прямо, и это при­да­ва­ло ей цар­ствен­ный вид.',
];
window.vopr.nev=[
	'Ли­те­ра­ту­ра — ВЕ­ЛИ­КОЕ до­сто­я­ние на­ро­да.',
	'На­ро­ду было ВЕ­ЛИ­КОЕ мно­же­ство, как будто весь город по­же­лал уви­деть поэта и услы­шать его уди­ви­тель­ный голос.',
	'Каж­дый ВЕ­ЛИ­КИЙ поэт яв­ля­ет­ся вы­ра­зи­те­лем духа на­ро­да, его ис­то­рии.',
];
window.vopr.rsh='ВЕ­ЛИ­КИЙ — пре­вы­ша­ю­щий обыч­ную меру, срав­ни­тель­но с дру­ги­ми. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ВЕ­ЛИ­ЧЕ­СТВЕН­НЫЙ.';

AtoB();
 
})();
