(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова КАМЕННЫЙ нужно упо­тре­бить слово КАМЕНИСТЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Пе­ре­се­лен­цам в этих краях при­хо­ди­лось очень туго: КАМЕННАЯ почва с тру­дом под­да­ва­лась об­ра­бот­ке.',
];
window.vopr.nev=[
	'Пер­вые КАМЕННЫЕ ору­дия были из­го­тов­ле­ны че­ло­ве­ком много веков назад.',
	'КАМЕННОЕ лицо Ва­си­лия не вы­ра­жа­ло ни­ка­ких эмо­ций.',
	'Ста­рин­ный КАМЕННЫЙ особ­няк был фа­миль­ной гор­до­стью этой семьи.',
];
window.vopr.rsh='КА­МЕН­НЫЙ — со­сто­я­щий из камня. По кон­тек­сту под­ра­зу­ме­ва­ет­ся КА­МЕ­НИ­СТАЯ почва.';

AtoB();
 
})();
