(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ДОВЕРЧИВЫЙ нужно употребить слово ДОВЕРИТЕЛЬНЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Отношения между начальником и его подчинённым постепенно приобрели более ДОВЕРЧИВЫЙ характер.',
];
window.vopr.nev=[
	'Среди ДОВЕРЧИВЫХ людей нередко встречаются те, кто поплатился за свою доверчивость.',
	'Это было существо ДОВЕРЧИВОЕ, робкое и слабое.',
	'Братья его были настолько наивными и ДОВЕРЧИВЫМИ, что обмануть их было совсем нетрудно.',
];
window.vopr.rsh='ДОВЕРЧИВЫЙ — легко доверяющий. По контексту подразумевается ДОВЕРИТЕЛЬНЫЙ.';

AtoB();
 
})();
