(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ВОД­НЫЙ нужно упо­тре­бить ВО­ДЯ­НИ­СТЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Не­зна­ко­мец по­да­рил мне бу­ке­тик ли­ло­вых цве­тов с ВОД­НЫ­МИ стеб­ля­ми.',
];
window.vopr.nev=[
	'На месте ВОД­НОЙ глади часто воз­ни­ка­ет гряз­ная бо­лот­ная тря­си­на, ко­то­рая по­сте­пен­но за­рас­та­ет лесом.',
	'Со вре­ме­нем ВОД­НАЯ по­верх­ность озера ста­но­вит­ся зе­ле­но­ва­той или крас­но­ва­той: в ней по­се­ля­ют­ся ми­ри­а­ды кле­ток мик­ро­во­до­рос­лей.',
	'ВОД­НЫЙ ста­ди­он — гор­дость рай­о­на и из­люб­лен­ное место го­ро­жан, куда они при­хо­дят се­мья­ми в вы­ход­ные дни.',
];
window.vopr.rsh='Кор­рект­но: Не­зна­ко­мец по­да­рил мне бу­ке­тик ли­ло­вых цве­тов с ВО­ДЯ­НИ­СТЫ­МИ стеб­ля­ми.';

AtoB();
 
})();
