(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ПРАКТИЧЕСКИЙ нужно употребить ПРАКТИЧНЫЙ?;'
	+'<br/>';
window.vopr.ver=[
	'Марина Васильевна очень взволновалась, но всё-таки прислушалась к мудрой и ПРАКТИЧЕСКОЙ своей приятельнице.',
];
window.vopr.nev=[
	'Важное значение для дальнейшей жизни имеют ПРАКТИЧЕСКИЕ навыки, приобретённые в раннем детстве.',
	'Вихрев в ПРАКТИЧЕСКОЙ жизни отличался редкостным простодушием.',
	'Система ПРАКТИЧЕСКИХ занятий широко распространена в высшей школе.',
];
window.vopr.rsh='ПРАКТИЧЕСКИЙ — занимающийся применением каких-либо знаний на деле, развивающий умения, знания, опыт в сфере какой-либо деятельности. По контексту подразумевается ПРАКТИЧНЫЙ.';

AtoB();
 
})();
