(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ДЕМОКРАТИЧЕСКИЙ нужно употребить ДЕМОКРАТИЧНЫЙ?;'
	+'<br/>';
window.vopr.ver=[
	'Игрушка — одно из ярких проявлений массовой культуры, глубоко жизненное и ДЕМОКРАТИЧЕСКОЕ.',
];
window.vopr.nev=[
	'В предвыборную борьбу выступила не так давно сформированная ДЕМОКРАТИЧЕСКАЯ партия.',
	'В своих письмах Гоббс оставался противником ДЕМОКРАТИЧЕСКОГО образа правления.',
	'В пресс-релизе указано на возросшее значение объединения всех прогрессивных и ДЕМОКРАТИЧЕСКИХ сил.',
];
window.vopr.rsh='ДЕМОКРАТИЧЕСКИЙ — основанный на принципах демократии. По контексту подразумевается ДЕМОКРАТИЧНЫЙ.';

AtoB();
 
})();
