(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ДЕ­МО­КРА­ТИ­ЧЕ­СКИЙ нужно упо­тре­бить ДЕ­МО­КРА­ТИЧ­НЫЙ?;'
	+'<br/>';
window.vopr.ver=[
	'Иг­руш­ка — одно из ярких про­яв­ле­ний мас­со­вой куль­ту­ры, глу­бо­ко жиз­нен­ное и ДЕ­МО­КРА­ТИ­ЧЕ­СКОЕ.',
];
window.vopr.nev=[
	'В пред­вы­бор­ную борь­бу вы­сту­пи­ла не так давно сфор­ми­ро­ван­ная ДЕ­МО­КРА­ТИ­ЧЕ­СКАЯ пар­тия.',
	'В своих пись­мах Гоббс оста­вал­ся про­тив­ни­ком ДЕ­МО­КРА­ТИ­ЧЕ­СКО­ГО об­ра­за прав­ле­ния.',
	'В пресс-ре­ли­зе ука­за­но на воз­рос­шее зна­че­ние объ­еди­не­ния всех про­грес­сив­ных и ДЕ­МО­КРА­ТИ­ЧЕ­СКИХ сил.',
];
window.vopr.rsh='ДЕ­МО­КРА­ТИ­ЧЕ­СКИЙ — ос­но­ван­ный на прин­ци­пах де­мо­кра­тии. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ДЕ­МО­КРА­ТИЧ­НЫЙ.';

AtoB();
 
})();
