(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ПРЕДСТАВИТЬ (ПРЕДСТАВЛЯТЬ) нужно употребить ПРЕДОСТАВИТЬ (ПРЕДОСТАВЛЯТЬ)?;'
	+'<br/>';
window.vopr.ver=[
	'Русский язык — это громаднейшее богатство, которое ПРЕДСТАВЛЯЕТ нам необычайные возможности.',
];
window.vopr.nev=[
	'За большие заслуги перед государством артиста ПРЕДСТАВИЛИ к правительственной награде.',
	'Этот дом ПРЕДСТАВЛЯЕТ собой историческую ценность.',
	'На совещании нам ПРЕДСТАВИЛИ нового сотрудника.',
];
window.vopr.rsh='ПРЕДСТАВЛЯТЬ возможности — приводить, излагать, сообщать, воображать возможности. По контексту подразумевается ПРЕДОСТАВЛЯТЬ возможности. ';

AtoB();
 
})();
