(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ПРЕД­СТА­ВИТЬ (ПРЕД­СТАВ­ЛЯТЬ) нужно упо­тре­бить ПРЕДО­СТА­ВИТЬ (ПРЕДО­СТАВ­ЛЯТЬ)?;'
	+'<br/>';
window.vopr.ver=[
	'Рус­ский язык — это гро­мад­ней­шее бо­гат­ство, ко­то­рое ПРЕД­СТАВ­ЛЯ­ЕТ нам не­обы­чай­ные воз­мож­но­сти.',
];
window.vopr.nev=[
	'За боль­шие за­слу­ги перед го­су­дар­ством ар­ти­ста ПРЕД­СТА­ВИ­ЛИ к пра­ви­тель­ствен­ной на­гра­де.',
	'Этот дом ПРЕД­СТАВ­ЛЯ­ЕТ собой ис­то­ри­че­скую цен­ность.',
	'На со­ве­ща­нии нам ПРЕД­СТА­ВИ­ЛИ но­во­го со­труд­ни­ка.',
];
window.vopr.rsh='ПРЕД­СТАВ­ЛЯТЬ воз­мож­но­сти — при­во­дить, из­ла­гать, со­об­щать, во­об­ра­жать воз­мож­но­сти. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ПРЕДО­СТАВ­ЛЯТЬ воз­мож­но­сти. ';

AtoB();
 
})();
