(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ВЕЧ­НЫЙ нужно упо­тре­бить ВЕ­КО­ВОЙ?'
	+'<br/>';
window.vopr.ver=[
	'Гу­стые за­рос­ли ку­стар­ни­ка че­ре­до­ва­лись с ВЕЧ­НЫ­МИ ду­бо­вы­ми ро­ща­ми и берёзо­вы­ми ле­соч­ка­ми.',
];
window.vopr.nev=[
	'Дол­ги­ми осен­ни­ми ве­че­ра­ми хо­зя­ин не вы­хо­дил из ком­на­ты и в не­из­мен­ном ха­ла­те, с ВЕЧ­НОЮ труб­кою в зубах, сидел у окна.',
	'Среди ВЕЧ­НЫХ че­ло­ве­че­ских цен­но­стей наи­бо­лее важ­ной для него была чест­ность.',
	'В рай­о­нах ВЕЧ­НОЙ мерз­ло­ты дома стро­ят­ся по спе­ци­аль­ным про­ек­там.',
];
window.vopr.rsh='ВЕЧ­НЫЕ рощи — рощи, жи­ву­щие все­гда. По кон­тек­сту под­ра­зу­ме­ва­ют­ся ВЕ­КО­ВЫЕ рощи.';

AtoB();
 
})();
