(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ЕДИ­НЫЙ нужно упо­тре­бить ЕДИ­НИЧ­НЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'М. Горь­кий со­ве­то­вал кри­ти­кам об­ра­щать вни­ма­ние на ли­те­ра­ту­ру в целом, а не на ЕДИ­НЫЕ яв­ле­ния её.',
];
window.vopr.nev=[
	'Боль­шин­ство от­ри­ца­тель­ных ге­ро­ев Н. Го­го­ля можно со­брать в ЕДИ­НЫЙ образ пош­ло­сти.',
	'Во­круг го­лу­бо­ва­то-белая пу­сты­ня без ЕДИ­НОЙ скла­доч­ки — ни буг­ров, ни впа­дин.',
	'Про­све­ти­те­ли XVIII века счи­та­ли, что права и обя­зан­но­сти граж­да­ни­на долж­ны быть ЕДИ­НЫ­МИ для всех.',
];
window.vopr.rsh='ЕДИ­НЫЕ яв­ле­ния — яв­ле­ния це­лост­ные, не­раз­дель­ные. По кон­тек­сту под­ра­зу­ме­ва­ют­ся ЕДИ­НИЧ­НЫЕ яв­ле­ния.';

AtoB();
 
})();
