(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ДОЖДЕВОЙ нужно упо­тре­бить слово ДОЖДЛИВЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'День обе­щал быть вет­ре­ным и ДОЖ­ДЕ­ВЫМ.',
];
window.vopr.nev=[
	'На тем­ном листе бле­сте­ла одна-един­ствен­ная ДОЖ­ДЕ­ВАЯ капля.',
	'Сдви­гая ве­ко­вые камни, об­ру­ши­лись вниз ДОЖ­ДЕ­ВЫЕ по­то­ки.',
	'Из сада хлы­нул чи­стый ДОЖ­ДЕ­ВОЙ запах, дур­ма­ня­щий аро­мат цве­ту­щей липы.',
];
window.vopr.rsh='ДОЖ­ДЕ­ВОЙ день — день, свя­зан­ный с до­ждем. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ДОЖД­ЛИ­ВЫЙ день.';

AtoB();
 
})();
