(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ЗЛОЙ нужно упо­тре­бить ЗЛОСТ­НЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Имей­те в виду, что ЗЛЫЕ бра­ко­нье­ры яв­ля­ют­ся уго­лов­ны­ми пре­ступ­ни­ка­ми и будут не­пре­мен­но на­ка­за­ны.',
];
window.vopr.nev=[
	'Здесь было так не­уют­но и страш­но, как в за­кол­до­ван­ном цар­стве, где всё усну­ло по при­хо­ти ЗЛОЙ феи.',
	'Не по ЗЛОЙ воле он до­пус­кал про­ма­хи и ошиб­ки.',
	'Че­ло­век он был ЗЛОЙ: ему не­пре­мен­но нужно было кого-то му­чить.',
];
window.vopr.rsh='ЗЛЫЕ бра­ко­нье­ры — бра­ко­нье­ры, ис­пы­ты­ва­ю­щие злобу. По кон­тек­сту под­ра­зу­ме­ва­ют­ся ЗЛОСТ­НЫЕ бра­ко­нье­ры. ';

AtoB();
 
})();
