(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ДИПЛОМАТИЧНЫЙ нужно упо­тре­бить слово ДИПЛОМАТИЧЕСКИЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'Он по­сто­ян­но на­ру­шал ДИПЛОМАТИЧНЫЙ эти­кет, раз­го­ва­ри­вая с по­сла­ми без учета тре­бо­ва­ний ре­че­во­го по­ве­де­ния.',

];
window.vopr.nev=[
	'Кон­стан­тин — че­ло­век мяг­кий, тон­кий, весь­ма ДИПЛОМАТИЧНЫЙ.',
	'Ответ был со­став­лен в ДИПЛОМАТИЧНЫХ вы­ра­же­ни­ях.',
	'Вы­ступ­ле­ние глав­но­го ре­дак­то­ра ока­за­лось не­ожи­дан­но уклон­чи­вым и ДИПЛОМАТИЧНЫМ.',
];
window.vopr.rsh='ДИ­ПЛО­МА­ТИ­ЧЕ­СКИЙ эти­кет — свой­ствен­ный ди­пло­ма­ту эти­кет. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ДИ­ПЛО­МА­ТИ­ЧЕ­СКИЙ эти­кет.';

AtoB();
 
})();
