(function(){'use strict';
 
window.vopr.txt='В каком предложении вместо слова ПАМЯТНЫЙ нужно употребить слово ПАМЯТЛИВЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'До глубокой старости он оставался таким же словоохотливым, ПАМЯТНЫМ и энергичным. ',
];
window.vopr.nev=[
	'Это было очень ПАМЯТНОЕ событие для всей семьи.',
	'Этот ПАМЯТНЫЙ разговор повлиял на мою судьбу.',
	'Мне дорог и ПАМЯТЕН каждый уголок родного дома.',
];
window.vopr.rsh='ПАМЯТНЫЙ — запоминающийся. По контексту подразумевается ПАМЯТЛИВЫЙ.';

AtoB();
 
})();
