(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ПАМЯТНЫЙ нужно упо­тре­бить слово ПАМЯТЛИВЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'До глу­бо­кой ста­ро­сти он оста­вал­ся таким же сло­во­охот­ли­вым, ПАМЯТНЫМ и энер­гич­ным. ',
];
window.vopr.nev=[
	'Это было очень ПАМЯТНОЕ со­бы­тие для всей семьи.',
	'Этот ПАМЯТНЫЙ раз­го­вор по­вли­ял на мою судь­бу.',
	'Мне дорог и ПАМЯТЕН каж­дый уго­лок род­но­го дома.',
];
window.vopr.rsh='ПА­МЯТ­НЫЙ — за­по­ми­на­ю­щий­ся. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ПА­МЯТ­ЛИ­ВЫЙ.';

AtoB();
 
})();
