(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ВЗРЫВНОЙ нужно упо­тре­бить слово ВЗРЫВЧАТЫЙ?<br/>';
 +'<br/>';
window.vopr.ver=[
	'Нужно сле­дить за тем, чтобы дети не иг­ра­ли со ВЗРЫВНЫМИ пред­ме­та­ми.',

];
window.vopr.nev=[
	'ВЗРЫВНОЙ вол­ной были вы­би­ты все стёкла со­сед­не­го дома.',
	'Во­ен­ные без осо­бых уси­лий су­ме­ли обез­вре­дить ВЗРЫВНОЕ устрой­ство.',
	'ВЗРЫВНОЙ ха­рак­тер Ильи мешал го­стям со­сре­до­то­чить­ся и по­нять, что он хочет им ска­зать.',
];
window.vopr.rsh='ВЗРЫВ­НОЙ — от­но­ся­щий­ся к взры­вам. По кон­тек­сту под­ра­зу­ме­ва­ет­ся ВЗРЫВ­ЧА­ТЫЙ (ве­ще­ства все­гда ВЗРЫВ­ЧА­ТЫЕ, а не ВЗРЫВ­НЫЕ).';

AtoB();
 
})();
