(function(){'use strict';
 
window.vopr.txt='В каком пред­ло­же­нии вме­сто слова ИСПОЛНИТЕЛЬСКИЙ нужно упо­тре­бить слово ИСПОЛНИТЕЛЬНЫЙ?'
	+'<br/>';
window.vopr.ver=[
	'Одна из вет­вей го­су­дар­ствен­ной вла­сти — ИСПОЛНИТЕЛЬСКАЯ.',
];
window.vopr.nev=[
	'Наша стра­на может гор­дить­ся цир­ко­вым ИСПОЛНИТЕЛЬСКИМ ис­кус­ством.',
	'Каж­дый на­сто­я­щий му­зы­кант дол­жен ин­те­ре­со­вать­ся ве­ко­вы­ми тра­ди­ци­я­ми на­род­ной и клас­си­че­ской ИСПОЛНИТЕЛЬСКОЙ куль­ту­ры.',
	'ИСПОЛНИТЕЛЬСКОЕ ма­стер­ство актёра до­стой­но вос­хи­ще­ния.',
];
window.vopr.rsh='';

AtoB();
 
})();
