(function(){'use strict';
var v1=sl(10,100);
var v2=slKrome(v1,10,100);
var t1=sklonlxkand(om.transportm.ie.iz());

window.vopr.txt='Половину времени, затраченного на '+['путь','дорогу','рейс','поездку'].iz()+', '+t1.ie+' '+['ехал','двигался'].iz()+
    ' со скоростью '+v1+' км/ч, а '+['вторую половину','оставщуюся часть'].iz()+' времени – со скоростью '+v2+' км/ч. '+
    'Найдите среднюю скорость '+t1.re+' на протяжении всего '+['пути','маршрута'].iz()+'. Ответ дайте в км/ч.';
window.vopr.ver=[ ((v1+v2)/2).ts() ];
})();
//Обзад 99603
