(function() {
	'use strict';
	retryWhileError(function() {
		/* Расстояние между городами A и B равно 390 км. Из города A в город В выехал первый автомобиль, а через два часа после этого навстречу ему из города B выехал со скоростью 75 км/ч второй автомобиль. Найдите скорость первого автомобиля, если автомобили встретились на расстоянии240 км от города A. Ответ дайте в км/ч. */

		let s1 = sl(1, 1000, 1);
		let s2 = sl(1, s1-1);
		let n = sl(1, 10, 0.5);
		let v2 = sl(20, 75, 1);

		let v1 = s2/((s1-s2)/v2+n);
		
		let r1 = sl1();
		genAssert(v1>20,'Скорость меньше 20');
		genAssertZ1000(v1);

		let the_humanSettlementDestination = sklonlxkand(decor.humanSettlementDestination.iz()); // ["пункт","город","село","деревня"]
		let the_vehicleRacingOnRoad = sklonlxkand(decor.vehicleRacingOnRoad.iz()); // ["автомобиль","мотоцикл","велосипед","электросамокат","гироскутер","мотоциклист","велосипедист","машина","гонщик","грузовик","автомобилист"]
		let the_orderToFind = decor.orderToFind.iz(); // ["найдите","определите","вычислите"]

		let rod = the_vehicleRacingOnRoad.rod;
		
		NAtask.setTask({
			text: 'Расстояние между ' + the_humanSettlementDestination.tm + ' $A$ и $B$ равно $' + s1 + '$ км. ' +
				'Из ' + the_humanSettlementDestination.re + ' $A$ в ' + the_humanSettlementDestination.ve + ' $B$ '+selectVerbGender('выехал', rod)+' перв'+['ый','ая','ое'][rod]+' ' +
				the_vehicleRacingOnRoad.ie + ', ' +
				'а через '+[chislitlx(n, 'час'),(n*60).toChMin()].iz()+' после этого навстречу '+['ему','ей','ему'][rod]+' из '+the_humanSettlementDestination.re+
				' $B$ '+selectVerbGender('выехал', rod)+' со скоростью $' + v2 + '$ км/ч втор'+['ой','ая','ое'][rod] + ' ' +
				the_vehicleRacingOnRoad.ie + '. ' + the_orderToFind.toZagl() + ' скорость перв'+['ого','ой','ого'][rod] + ' ' + the_vehicleRacingOnRoad.re +
				', если ' + the_vehicleRacingOnRoad.im + ' встретились на расстоянии $' + [s2,s1-s2][r1] + '$ км от ' +
				the_humanSettlementDestination.re + ' $'+['A','B'][r1]+'$. Ответ дайте в км/ч.',
			answers: v1,
			authors: ['Александра Суматохина'],
		});
		NAtask.modifiers.allDecimalsToStandard( /*true*/ );
		NAtask.modifiers.variativeABC();
	}, 2000);
})();
// РешуЕГЭ: 
//99591 112891 113079 509995 526250 112801 112803 112805 112807 112809 112811 112813 112815 112817 112819 112821 112823 112825 112827 112829 112831 112833 112835 112837 112839 112841 112843 112845 112847 112849 112851 112853 112855 112857 112859 112861 112863 112865 112867 112869 112871 112873 112875 112877 112879 112881 112883 112885 112887 112889 112893 112895 112897 112899 112901 112903 112905 112907 112909 112911 112913 112915 112917 112919 112921 112923 112925 112927 112929 112931 112933 112935 112937 112939 112941 112943 112945 112947 112949 112951 112953 112955 112957 112959 112961 112963 112965 112967 112969 112971 112973 112975 112977 112979 112981 112983 112985 112987 112989 112991 112993 112995 112997 112999 113001 113003 113005 113007 113009 113011 113013 113015 113017 113019 113021 113023 113025 113027 113029 113031 113033 113035 113037 113039 113041 113043 113045 113047 113049 113051 113053 113055 113057 113059 113061 113063 113065 113067 113069 113071 113073 113075 113077 
