(function () {
	'use strict';
	retryWhileError(function () {
		/* Юля и Уля, работая вместе, пропалывают грядку за 24 минуты, аодна Уля - за 120 минут. За сколько минут пропалывает грядку одна Юля? */
		let rand = sl1();
		let one = ['одна', 'один'][rand];
		let names = [om.childFemaleNames, om.childMaleNames][rand].iz(2);
		let timeFirst = sl(15, 80);
		let timeSecond = slKrome(timeFirst, 15, 80);
		let timeAll = timeFirst * timeSecond / (timeFirst + timeSecond);

		genAssert(timeAll.isAlmostInteger(), "Общее время не целое");

		let work = [
			['пропалывают', 'пропалывает', 'грядку'],
			['красят', 'покрасит', ['забор', 'клумбы', 'бордюр', 'оконные рамы'].iz()],
			['лепят', 'слепит', 'тарелку ' + ['пельменей', 'беляшей', 'вареников', 'пирожков'].iz()],
			['подметают', 'подметёт', 'дорожку на даче'],
			['косят', 'скосит', 'траву около дома'],
			['моют', 'помоет', ['посуду', 'бабушкин сервиз', 'набор для чаепития'].iz()],
			['чистят', 'почистит', 'ведро ' + ['картошки', 'морковки', 'свёклы', 'лука', 'чеснока'].iz()],
			['готовят', 'приготовит', ['обед', 'ужин', 'праздничный стол'].iz()],
			['рисуют', 'нарисует', 'плакаты о вреде курения', 'поздравительные открытки', 'афиши для школьного выступления'],
		].iz();

		NAtask.setTask({
			text: names.shuffleJoin(' и ') + ', ' +
				'работая вместе, ' +
				work[0] + ' ' + work[2] + ' за ' + timeAll.randToChMin('v') + ', ' +
				'а ' + one + ' ' + names[0] + ' - за ' + timeFirst.randToChMin('v') + '. ' +
				'За сколько минут ' + work[1] + ' ' + work[2] + ' ' + one + ' ' + names[1] + '?',
			answers: timeSecond,
			authors: ['Александра Суматохина'],
		});
	}, 1000);
})();
// РешуЕГЭ: 
// 99617 118605 118731 118735 639626 639748 660975 661022 118589 118591 118593 118595 118597 118599 118601 118603 118607 118609 118611 118613 118615 118617 118619 118621 118623 118625 118627 118629 118631 118633 118635 118637 118639 118641 118643 118645 118647 118649 118651 118653 118655 118657 118659 118661 118663 118665 118667 118669 118671 118673 118675 118677 118679 118681 118683 118685 118687 118689 118691 118693 118695 118697 118699 118701 118703 118705 118707 118709 118711 118713 118715 118717 118719 118721 118723 118725 118727 118729 11873
